In [20]:
import pandas as pd

In [21]:
data1={"Names":["Abdul","Satya","Vamsi"],
      "Age":[24,23,25],
      "salary":[25000,25000,27000]}

In [22]:
df1=pd.DataFrame(data1)

In [23]:
df1

   Names  Age  salary
0  Abdul   24   25000
1  Satya   23   25000
2  Vamsi   25   27000

In [24]:
data2={"Names":["Ramu","Dileep","Srikanth"],
      "Age":[25,24,26],
      "salary":[30000,27000,26000]}

In [25]:
df2=pd.DataFrame(data2)

In [26]:
df2

      Names  Age  salary
0      Ramu   25   30000
1    Dileep   24   27000
2  Srikanth   26   26000

In [27]:
#Concat
df3=pd.concat([df1,df2])

In [28]:
df3

      Names  Age  salary
0     Abdul   24   25000
1     Satya   23   25000
2     Vamsi   25   27000
0      Ramu   25   30000
1    Dileep   24   27000
2  Srikanth   26   26000

In [29]:
# above we have index repeted to correct this we can use ignore_index to get continous index
df3=pd.concat([df1,df2],ignore_index=True)

In [30]:
df3

      Names  Age  salary
0     Abdul   24   25000
1     Satya   23   25000
2     Vamsi   25   27000
3      Ramu   25   30000
4    Dileep   24   27000
5  Srikanth   26   26000

In [31]:
#Keys
df3=pd.concat([df1,df2],keys=["508","509"])

In [32]:
df3

          Names  Age  salary
508 0     Abdul   24   25000
    1     Satya   23   25000
    2     Vamsi   25   27000
509 0      Ramu   25   30000
    1    Dileep   24   27000
    2  Srikanth   26   26000

In [33]:
df3.loc["508"]

   Names  Age  salary
0  Abdul   24   25000
1  Satya   23   25000
2  Vamsi   25   27000

In [35]:
df3.loc["509"]

      Names  Age  salary
0      Ramu   25   30000
1    Dileep   24   27000
2  Srikanth   26   26000

In [38]:
# By deafult it append data to rows to append as columns use axis =1
df4=pd.concat([df1,df2],axis=1)

In [40]:
#appends data agaist same index 
df4

   Names  Age  salary     Names  Age  salary
0  Abdul   24   25000      Ramu   25   30000
1  Satya   23   25000    Dileep   24   27000
2  Vamsi   25   27000  Srikanth   26   26000

In [41]:
#Merge

In [42]:
df1=pd.DataFrame({"Names":["Abdul","Satya","Vamsi"],
      "Age":[24,23,25]})

In [43]:
df1

   Names  Age
0  Abdul   24
1  Satya   23
2  Vamsi   25

In [46]:
df2=pd.DataFrame({"Names":["Satya","Vamsi","Abdul"],
      "salary":[25000,26000,27000]})

In [47]:
df2

   Names  salary
0  Satya   25000
1  Vamsi   26000
2  Abdul   27000

In [48]:
pd.merge(df1,df2,on="Names")

   Names  Age  salary
0  Abdul   24   27000
1  Satya   23   25000
2  Vamsi   25   26000

In [50]:
#if it doesn't have same number of rows and some different rows in the both the dataframes we only get the common data in both the df

In [51]:
df1=pd.DataFrame({"Names":["Abdul","Rahiman","satya","vamsi"],
                  "Age":[25,23,32,43]})

In [52]:
df1

     Names  Age
0    Abdul   25
1  Rahiman   23
2    satya   32
3    vamsi   43

In [62]:
df2=pd.DataFrame({"Names":["vamsi","satya","srikanth"],
                  "Salary":[25000,34000,40000]})

In [63]:

df2

      Names  Salary
0     vamsi   25000
1     satya   34000
2  srikanth   40000

In [64]:
#by deafult it work like inner join only get common data
pd.merge(df1,df2,on="Names")

   Names  Age  Salary
0  satya   32   34000
1  vamsi   43   25000

In [65]:
#outer--- get all the data from both dfs
pd.merge(df1,df2,on="Names",how="outer")

      Names   Age   Salary
0     Abdul  25.0      NaN
1   Rahiman  23.0      NaN
2     satya  32.0  34000.0
3     vamsi  43.0  25000.0
4  srikanth   NaN  40000.0

In [60]:
#left---get all the data from left data frame and common data frame from right

In [66]:
pd.merge(df1,df2,on="Names",how="left")

     Names  Age   Salary
0    Abdul   25      NaN
1  Rahiman   23      NaN
2    satya   32  34000.0
3    vamsi   43  25000.0

In [67]:
#right---get all the data from right data frame and common data frame from left
pd.merge(df1,df2,on="Names",how="right")

      Names   Age  Salary
0     vamsi  43.0   25000
1     satya  32.0   34000
2  srikanth   NaN   40000

In [68]:
# indicater --- give additional column to say in which data frame the data is present 
pd.merge(df1,df2,on="Names",how="outer",indicator=True)

      Names   Age   Salary      _merge
0     Abdul  25.0      NaN   left_only
1   Rahiman  23.0      NaN   left_only
2     satya  32.0  34000.0        both
3     vamsi  43.0  25000.0        both
4  srikanth   NaN  40000.0  right_only

In [69]:
#if we have same column Names then in result it we show suffixes as X,y 
df1=pd.DataFrame({"Names":["Abdul","Rahiman","satya","vamsi"],
                  "Age":[25,23,32,43]})

In [70]:
df2=pd.DataFrame({"Names":["Abdul","Rahiman","satya","vamsi"],
                  "Age":[25,23,32,43]})

In [71]:
pd.merge(df1,df2,on="Names",how="outer",indicator=True)

     Names  Age_x  Age_y _merge
0    Abdul     25     25   both
1  Rahiman     23     23   both
2    satya     32     32   both
3    vamsi     43     43   both